---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TilePatternGridUnitX
source: html/efcfd911-3107-abba-3a5a-59036d14f2f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TilePatternGridUnitX Property

"Horizontal spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId TilePatternGridUnitX { get; }
```